tangyangguang/Esp8266Base/src/Esp8266BaseWeb.h
#pragma once
#include "Esp8266BaseOptions.h"
#include <Arduino.h>
#include <ESP8266WebServer.h>

// ----------------------------------------------------------------------------
// Esp8266BaseWeb — 极简管理 Web
//
// 完整模式提供全部管理路由；ESP8266BASE_PROFILE_MQTT_TERMINAL=1 时只注册
// GET / 根引导、GET/POST /wifi、GET/POST /auth、GET /health、POST /ota
// 和应用扩展路由。
// /system 是维护入口页面；/reboot 只保留 POST 重启动作
// 应用扩展：最多 4 页面 + 6 API（静态数组，不动态分配）
// Basic Auth 默认开启
// HTML 全部放 PROGMEM，动态响应分段发送
//
// RAM 预算：<= 1.20KB（路由表 + 导航配置 + 状态 + 认证字段 + 首页系统信息）
// ----------------------------------------------------------------------------

#ifndef ESP8266BASE_WEB_MAX_APP_PAGES
#define ESP8266BASE_WEB_MAX_APP_PAGES 4
#endif

#ifndef ESP8266BASE_WEB_MAX_APP_APIS
#define ESP8266BASE_WEB_MAX_APP_APIS 6
#endif

#if ESP8266BASE_WEB_MAX_APP_PAGES > 4
#error "ESP8266BASE_WEB_MAX_APP_PAGES cannot exceed 4"
#endif

#if ESP8266BASE_WEB_MAX_APP_APIS > 6
#error "ESP8266BASE_WEB_MAX_APP_APIS cannot exceed 6"
#endif

#ifndef ESP8266BASE_WEB_AUTH_USER
#define ESP8266BASE_WEB_AUTH_USER "admin"
#endif

#ifndef ESP8266BASE_WEB_AUTH_PASS
#define ESP8266BASE_WEB_AUTH_PASS "admin"
#endif

// 堆水位闸门：在 ESP8266WebServer 的 addHook 预解析钩子里（读完请求行、
// 解析请求头之前）检查。低于阈值直接回 503 并关闭连接，请求头尚未解析，
// 拒绝本身几乎不消耗堆。
// 阈值口径：从该点起一个轻量请求还要吃 解析(~1KB)+鉴权(~0.5KB)+响应在途
// (~1KB) ≈ 2.5KB，加 ~2KB 安全底 → ~4.5KB。阈值越高越保守（低堆时拒绝更多）。
// WiFiServer accepts peers in SDK/system context before the HTTP heap hook can
// run, and each pending ClientContext uses operator new. Bound pending peers
// so low-heap bursts cannot grow to the Core default of five and throw OOM
// before the pre-parse 503 guard gets control.
#ifndef ESP8266BASE_WEB_TCP_BACKLOG
#define ESP8266BASE_WEB_TCP_BACKLOG 1U
#endif
#if ESP8266BASE_WEB_TCP_BACKLOG < 1U || ESP8266BASE_WEB_TCP_BACKLOG > 2U
#error "ESP8266BASE_WEB_TCP_BACKLOG must be 1 or 2"
#endif

#ifndef ESP8266BASE_WEB_HEAP_GATE_FREE_BYTES
#define ESP8266BASE_WEB_HEAP_GATE_FREE_BYTES 4608U
#endif
#ifndef ESP8266BASE_WEB_HEAP_GATE_BLOCK_BYTES
#define ESP8266BASE_WEB_HEAP_GATE_BLOCK_BYTES 3072U
#endif

typedef void (*Esp8266BaseWebHandler)();

enum class Esp8266BaseWebHomeMode : uint8_t {
    DEFAULT_SYSTEM_HOME = 0,
    APP_HOME_FIRST     = 1,
    FUSED_HOME         = 2
};

enum class Esp8266BaseWebSystemNavMode : uint8_t {
    TOP_NAV        = 0,
    BOTTOM_NAV     = 1,
    FOOTER_COMPACT = 2
};

enum class Esp8266BaseWebBuiltinLabel : uint8_t {
    HOME = 0,
    LOGS = 1,
    SYSTEM = 2
};

class Esp8266BaseWeb {
public:
    static bool begin();
    static void handle();
    static bool isRunning();

    // 注册应用自定义路由（begin() 之后调用）
    static bool addPage(const char* path, const char* title, Esp8266BaseWebHandler handler);
    static bool addApi (const char* path, Esp8266BaseWebHandler handler);

    // 应用 Web 信息架构配置（通常在 begin() 前调用）
    static void setDeviceName(const char* name);
    static void setHomePath(const char* path);
    static void setHomeMode(Esp8266BaseWebHomeMode mode);
    static void setSystemNavMode(Esp8266BaseWebSystemNavMode mode);
    static void setBuiltinLabel(Esp8266BaseWebBuiltinLabel label, const char* title);

    // 应用 handler 辅助函数（在自定义 handler 内使用）
    static void sendHeader();                     // 输出 HTTP 头 + HTML head + 导航栏
    static void sendFooter();                     // 输出 HTML 尾（含 free heap）
    static void sendContent_P(PGM_P content);     // 从 PROGMEM 流式输出
    static void sendChunk(const char* content);   // 流式输出动态内容块
    static bool checkAuth();                      // 验证 Basic Auth，失败自动返回 401
    static bool verifyAuth();                     // 仅验证，不发 401
    // 最近一次被服务的 HTTP 请求时间戳（monotonic ms），供其它模块错峰使用。
    static uint32_t lastActivityMs();
    static void setDefaultAuth(const char* user, const char* pass);

    // 暴露底层 server，供需要直接操作的 handler 使用
    static ESP8266WebServer& server();

    // 供 Esp8266Base 在 begin() 时设置系统信息
    static void setSystemInfo(const char* hostname, const char* fw, const char* ver, uint32_t bootCount);

private:
    struct AppRoute {
        char                  path[24];   // 24B
        char                  title[18];  // 18B
        Esp8266BaseWebHandler handler;    // 4B
        bool                  isApi;      // 1B
        bool                  showInNav;  // 1B
    };

    static ESP8266WebServer _server;                            // ~272B
#if ESP8266BASE_WEB_MAX_APP_PAGES > 0
    static AppRoute         _pages[ESP8266BASE_WEB_MAX_APP_PAGES]; // 4×52=208B
#endif
#if ESP8266BASE_WEB_MAX_APP_APIS > 0
    static AppRoute         _apis [ESP8266BASE_WEB_MAX_APP_APIS];  // 6×52=312B
#endif
#if ESP8266BASE_WEB_MAX_APP_PAGES > 0
    static uint8_t          _pageCount;                         // 1B
#endif
#if ESP8266BASE_WEB_MAX_APP_APIS > 0
    static uint8_t          _apiCount;                          // 1B
#endif
    static bool             _running;                           // 1B
    static uint32_t         _lastActivityMs;                    // 4B
    static char             _authUser[24];                      // 24B
    static char             _authPass[24];                      // 24B
    static char             _deviceName[24];                    // 24B
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    static char             _homePath[24];                      // 24B
#endif
    static char             _hostname[33];                      // 33B
    static char             _fwName[24];                        // 24B
    static char             _fwVersion[16];                     // 16B
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    static uint32_t         _bootCount;                         // 4B
    static char             _titleBuf[80];                      // "hostname (fw ver)" 80B
#endif
    static char             _activeUri[32];                     // 当前请求 URI，用于慢请求日志
    static char             _activeMethod[5];                   // GET/POST
    static uint32_t         _formToken;                         // 内置维护表单每次启动令牌
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    static char             _builtinLabels[3][16];              // Status/Logs/System
    static Esp8266BaseWebHomeMode      _homeMode;
    static Esp8266BaseWebSystemNavMode _systemNavMode;
#endif

    // 预解析钩子：堆水位闸门 + 请求活动时间戳（addHook 注册）
    static ESP8266WebServer::ClientFuture _heapGateHook(
        const String& method, const String& url, WiFiClient* client,
        ESP8266WebServer::ContentTypeFunction contentType);

    // 内置路由处理函数（静态，无捕获）
    static void _markRequest();
    static void _handleAppPage(uint8_t index);
    static void _handleAppApi(uint8_t index);
    static void _handleAppPage0();
    static void _handleAppPage1();
    static void _handleAppPage2();
    static void _handleAppPage3();
    static void _handleAppApi0();
    static void _handleAppApi1();
    static void _handleAppApi2();
    static void _handleAppApi3();
    static void _handleAppApi4();
    static void _handleAppApi5();
    static void _handleWiFiGet();
    static void _handleWiFiPost();
    static void _handleAuthGet();
    static void _handleAuthPost();
#if ESP8266BASE_USE_OTA && !ESP8266BASE_PROFILE_MQTT_TERMINAL
    static void _handleOtaGet();   // OTA GET 由此处理，POST 由 Esp8266BaseOTA 注册
#endif
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    static void _handleRoot();
    static void _handleSystemHome();
#if ESP8266BASE_USE_FILELOG
    static void _handleLogsGet();
    static void _handleLogsClearPost();
    static void _handleFileLogPost();
#endif
    static void _handleHostnamePost();
    static void _handleHostnameApiGet();
    static void _handleHostnameApiPost();
    static void _handleSystemGet();
    static void _handleRebootPost();
#else
    static void _handleTerminalRoot();
    static void _handleTerminalDispatch();
#endif
    static void _handleHealth();
    static void _handleNotFound();
#if !ESP8266BASE_PROFILE_MQTT_TERMINAL
    static const char* _builtinLabel(Esp8266BaseWebBuiltinLabel label);
    static const char* _brandTitle();
    static const char* _brandHref();
    static void _sendSystemLinks();
#endif
    static void _sendLink(const char* path, const char* title, const char* cls = nullptr);
    static void _sendAppLinks();
    static void _sendFormToken();
    static bool _verifyFormToken();
    static void _loadPersistedAuth();
    static void _formatDuration(uint32_t seconds, char* out, size_t len);
    static void _formatFooterUptime(uint32_t seconds, char* out, size_t len);
    static void _sendKv(const char* key, const char* value);
};
